#include "common.h"
#include "FreeRTOS.h"
#include "task.h"

// Задача для системного светодиода
void vLedTask(void *pvParameters) {
    (void)pvParameters; // Избавляемся от предупреждения об неиспользуемом параметре

    while (1) {
        LED_SYSTEM_TOGGLE;
        // Нативная блокировка задачи во FreeRTOS на 500 мс (светодиод будет мигать 1 раз в секунду)
        vTaskDelay(pdMS_TO_TICKS(500));
    }
}

int main(void) {
    // 1. Настройка тактирования микроконтроллера на 96 МГц
    system_clock_config_96MHz();

    // 2. Инициализация аппаратной периферии (GPIO и т.д.)
    hw_init();


    // 3. Создаем задачу мигания светодиодом
    xTaskCreate(
        vLedTask,                 // Указатель на функцию задачи
        "LED_Blink",              // Имя задачи для отладчика
        configMINIMAL_STACK_SIZE, // Размер стека (128 слов = 512 байт)
        NULL,                     // Параметры, передаваемые в задачу
        1,                        // Приоритет (1 - низкий, выше приоритета Idle-задачи)
        NULL                      // Дескриптор (хэндл) задачи нам пока не нужен
    );

    // 4. Запускаем планировщик операционной системы
    vTaskStartScheduler();

    // Сюда код дойдет только в случае, если под Heap (кучу) не хватило оперативной памяти
    while (1) {
        // Аварийное состояние
    }
}
